In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df=pd.read_csv('/cxldata/datasets/project/wine_quality_red.csv')

In [4]:
df.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5

In [5]:
X=df.drop(['quality'],axis=1).values
y=df['quality'].values
y

array([5, 5, 5, ..., 6, 5, 6])

In [10]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, 
                                                    test_size=0.25)

In [11]:
from sklearn.model_selection import train_test_split
X1_train, X1_test, y1_train, y1_test = train_test_split(X, y,
                                                    stratify=y, 
                                                    test_size=0.25)

In [12]:
X1_train

array([[ 6.8 ,  0.59,  0.06, ...,  3.41,  0.59, 10.8 ],
       [ 8.4 ,  0.59,  0.29, ...,  3.15,  0.5 ,  9.1 ],
       [ 8.6 ,  0.37,  0.65, ...,  3.27,  0.58, 11.  ],
       ...,
       [ 9.3 ,  0.36,  0.39, ...,  3.47,  0.73, 10.9 ],
       [ 8.1 ,  0.78,  0.1 , ...,  3.36,  0.49,  9.5 ],
       [ 8.9 ,  0.48,  0.53, ...,  3.21,  0.59, 12.1 ]])

In [6]:
df1=pd.read_csv('/cxldata/datasets/project/sales_historical_sales_value.csv')
df2=pd.read_csv('/cxldata/datasets/project/sales_disposable_personal_income.csv')

In [7]:
df1.head()

   ID1  ID2                    time  value
0    1    2  11/13/2010 12:00:00 AM    130
1    1    2  11/20/2010 12:00:00 AM    222
2    1    2  11/27/2010 12:00:00 AM    166
3    1    2   12/4/2010 12:00:00 AM    174
4    1    2  12/11/2010 12:00:00 AM    236

In [18]:
df2.head()

                     time    value
0   11/7/2009 12:00:00 AM  10886.9
1  11/14/2009 12:00:00 AM  10886.9
2  11/21/2009 12:00:00 AM  10886.9
3  11/28/2009 12:00:00 AM  10886.9
4   12/5/2009 12:00:00 AM  10924.7

In [8]:
df3=pd.merge(df1, df2, on='time')

In [9]:
df3.head()

   ID1  ID2                    time  value_x  value_y
0    1    2  11/13/2010 12:00:00 AM      130  11160.8
1    2    1  11/13/2010 12:00:00 AM      142  11160.8
2    3    1  11/13/2010 12:00:00 AM       70  11160.8
3    4    2  11/13/2010 12:00:00 AM      314  11160.8
4    5    1  11/13/2010 12:00:00 AM      108  11160.8

In [10]:
df3.columns

Index(['ID1', 'ID2', 'time', 'value_x', 'value_y'], dtype='object')

In [11]:
df3.columns=['storeid', 'productid', 'time', 'vsales', 'disposable_imcome']

In [12]:
df3.head()

   storeid  productid                    time  vsales  disposable_imcome
0        1          2  11/13/2010 12:00:00 AM     130            11160.8
1        2          1  11/13/2010 12:00:00 AM     142            11160.8
2        3          1  11/13/2010 12:00:00 AM      70            11160.8
3        4          2  11/13/2010 12:00:00 AM     314            11160.8
4        5          1  11/13/2010 12:00:00 AM     108            11160.8

In [35]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2459 entries, 0 to 2458
Data columns (total 5 columns):
storeid              2459 non-null int64
productid            2459 non-null int64
time                 2459 non-null object
vsales               2459 non-null int64
disposable_imcome    2459 non-null float64
dtypes: float64(1), int64(3), object(1)
memory usage: 115.3+ KB

In [79]:
df3['datetime']=df3['time'].str[:5]

AttributeError: Can only use .str accessor with string values!

In [17]:
df3['disposable_imcome_lag'] = df3['disposable_imcome'].shift(7)
df3.head(15)

,storeid,productid,time,vsales,disposable_imcome,day_of_week,disposable_imcome_lag
0,1,2,2010-11-13,130,11160.8,Saturday,NaN
1,2,1,2010-11-13,142,11160.8,Saturday,NaN
2,3,1,2010-11-13,70,11160.8,Saturday,NaN
3,4,2,2010-11-13,314,11160.8,Saturday,NaN
4,5,1,2010-11-13,108,11160.8,Saturday,NaN
5,6,1,2010-11-13,438,11160.8,Saturday,NaN
6,7,1,2010-11-13,156,11160.8,Saturday,NaN
7,8,1,2010-11-13,352,11160.8,Saturday,11160.8
8,9,1,2010-11-13,326,11160.8,Saturday,11160.8
9,10,1,2010-11-13,152,11160.8,Saturday,11160.8
10,11,1,2010-11-13,152,11160.8,Saturday,11160.8
11,12,1,2010-11-13,1628,11160.8,Saturday,11160.8
12,13,1,2010-11-13,1374,11160.8,Saturday,11160.8
13,14,1,2010-11-13,548,11160.8,Saturday,11160.8
14,15,1,2010-11-13,172,11160.8,Saturday,11160.8

In [1]:
df3['disposable_imcome_lag'] = df3['disposable_imcome'].shift(1)

NameError: name 'df3' is not defined

In [13]:
df3['time'] = df3['time'].apply(lambda x : pd.to_datetime(str(x)))

In [14]:
df3['day_of_week']=df3['time'].dt.day_name()

In [18]:
df3['date']=df3['time'].dt.date

In [20]:
def season_of_date(date):
    year = str(date.year)
    seasons = {'spring': pd.date_range(start='21/03/'+year, end='20/06/'+year),
               'summer': pd.date_range(start='21/06/'+year, end='22/09/'+year),
               'autumn': pd.date_range(start='23/09/'+year, end='20/12/'+year)}
    if date in seasons['spring']:
        return 'spring'
    if date in seasons['summer']:
        return 'summer'
    if date in seasons['autumn']:
        return 'autumn'
    else:
        return 'winter'

# Assuming df has a date column of type `datetime`
df3['season'] = df3.date.map(season_of_date)

In [24]:
df3['weekday']=df3['day_of_week'].apply(lambda x:'weekend' if x=='Saturday' or x=='Sunday' else 'weekday')

In [26]:
 holidays = cal.holidays(start=start, end=end, return_name=True)

NameError: name 'cal' is not defined

In [50]:
df3['time'].str[:10]

0       11/13/2010
1       11/13/2010
2       11/13/2010
3       11/13/2010
4       11/13/2010
           ...
2454    11/6/2010
2455    11/6/2010
2456    11/6/2010
2457    11/6/2010
2458    11/6/2010
Name: time, Length: 2459, dtype: object

In [29]:
df3['productid'].value_counts()

1    2132
2     327
Name: productid, dtype: int64

In [53]:
df3['time'].str[:10]

0       11/13/2010
1       11/13/2010
2       11/13/2010
3       11/13/2010
4       11/13/2010
           ...
2454    11/6/2010
2455    11/6/2010
2456    11/6/2010
2457    11/6/2010
2458    11/6/2010
Name: time, Length: 2459, dtype: object